execution_jmeter.yml
execution:
- executor: jmeter
  scenario: blazedemo
  concurrency:
    local: 50
    cloud: 200
  hold-for: 6m
  ramp-up: 30s
  locations:
    us-west-1: 1
    us-east-1: 1
  # locations-weighted: false


reporting:
- module: final-stats
  summary: true
  dump-xml: stats.xml

settings:
  artifacts-dir: ./artifacts/%Y-%m-%d_%H-%M-%S.%f

modules:
  cloud:
    project: 252799
    test: 'Taurus from Scenario'
    report-name: 'Taurus from Scenario'